## by using naive_bayes classification algorithm...

In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')

In [2]:
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch',"Cabin",'Embarked','Ticket'], axis='columns',inplace=True)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [4]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [5]:
dummies = pd.get_dummies(df.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.drop(['Sex','female'],axis='columns',inplace = True)
inputs.head()

   Pclass   Age     Fare  male
0       3  22.0   7.2500     1
1       1  38.0  71.2833     0
2       3  26.0   7.9250     0
3       1  35.0  53.1000     0
4       3  35.0   8.0500     1

In [7]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [8]:
inputs.Age[0:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [9]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.Age[0:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [10]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size = 0.20)

In [11]:
len(inputs)

891

In [12]:
len(X_train)

712

In [13]:
X_train[:10]

     Pclass        Age      Fare  male
31        1  29.699118  146.5208     0
122       2  32.500000   30.0708     1
350       3  23.000000    9.2250     1
218       1  32.000000   76.2917     0
70        2  32.000000   10.5000     1
631       3  51.000000    7.0542     1
154       3  29.699118    7.3125     1
253       3  30.000000   16.1000     1
828       3  29.699118    7.7500     1
36        3  29.699118    7.2292     1

In [14]:
X_test[:5]

     Pclass   Age     Fare  male
489       3   9.0  15.9000     1
600       2  24.0  27.0000     0
471       3  38.0   8.6625     1
130       3  33.0   7.8958     1
127       3  24.0   7.1417     1

In [15]:
y_test.iloc[:5]

489    1
600    1
471    0
130    0
127    1
Name: Survived, dtype: int64

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train.values,y_train.values)

GaussianNB()

In [18]:
model.score(X_test.values,y_test.values)

0.770949720670391

In [19]:
model.predict([[3,22,7,0]])

array([1], dtype=int64)

In [20]:
y_test.iloc[:5]

489    1
600    1
471    0
130    0
127    1
Name: Survived, dtype: int64

In [21]:
model.predict(X_test.values[:5])

array([0, 1, 0, 0, 0], dtype=int64)

In [22]:
model.predict_proba(X_test.values[:5])

array([[0.95646674, 0.04353326],
       [0.25464594, 0.74535406],
       [0.97121183, 0.02878817],
       [0.97117197, 0.02882803],
       [0.9687899 , 0.0312101 ]])